# '========== Переменные =========='
# # переменные - это ссылка на ячейку памяти, где хранятся какието данные, для дальнейшего использования этих данных, при помощи обращения к названию переменной 

# number1 = 123 
# number2 = 23
# number1 + number2
# print(76356734,  number1 + number2) # ","
# print(123) #второй print чтобы выводили столбиком 

# '======== Правила наименования переменных ======='
# a = 5 # можно, но назначение не понятно
# # 1number = 123 - нельзя начинать название переменных с чисел
# # my-name = Umar - нельзя использовать в названии переменных символы, кроме _ (my_name)
# # hello world - нельзя использовать символы, кроме ( _ )
# # перенос строки (alt + z)

# # print = 12 - нельзя называть переменные ключевыми словами и названиями функций
# Snake Case - python стиль наименования переменной
# my_name = 'Umar'

# # Camel Case - стиль остальных языков программирования 
# myName = 'Umar' 

# '========= Ввод и вывод данных ========'
# # print - функция вывода данных в терминал
# # input - функция ввода данных с терминала 

# number = input('введите число:' )
# print(number)

# name = input('введите Имя: ')
# last_name = input('введите Фамилию: ')
# print(name, last_name)


# num1 = int(input('Введите первое число: '))
# num2 = int(input('Введите второе число: '))
# print(num1 + num2)

'========== Типы данных =========='

# Типы данных делятся на два вида: изменяемые и неизменяемые 

# Изменяемые: list(список), dict(словарь), set(множества)

# Неизменяемые: int(числа), float(вещественные), decimal(вещественные), str(строка), tuple(кортежи), bool(булевые), frozenset(не изменяемые сеты), complex, None(пустота)
