# '=================================== Логические и условные операторы =========================================='
# # логические операторы - выражения, которые вовращают true, если выражение верное, false - если выражение не верное 

# 'Равенство'
# 10 == 5 # false 
# 5 == 5 # true 
# 'hi' == 'hi' # true
# 'Hi' == 'hi' # false 
# '5' == 5 # false 
# '+' == '+' # true 

# 'Неравенство'
# 4 != 5 # true
# 5 != 5 # false 

# 'Больше'
# 10 > 10 # false 
# 4 > 1 # true 

# 'Меньше'
# 5 < 4 # false 
# 10 < 10 # false 
# 3 < 5 # true 

# 'Больше или равно'
# 10 >= 4 # true 
# 10 >= 10 # true
# 4 >= 5 # false 

# 'Меньше или равно'
# 10 <= 10 # true
# 5 <= 10 # true 
# 10 <= 5 # false 

# '================================== And or Not ========================================='

# # and - и 
# # or - или 
# # not - не 

# a = 5 
# b = 6 

# # true  и    true
# a == 5 and b == 6 # true 

# # false  и  true
# a == 7 and b == 6 # false 

# # flase и   true 
# a > 10 and b <= 6  # false 

# a == 0 and b == 0 # false 

# # если все части выражения возвращиют True - будет True 
# # если хотя бы одна часть выражения False - будет False 

# # True  или   True
# a == 5  or   b == 6 # True 

# #False или True
# a > 10 or b == 6 # True 

# #True  или  False
# a < 20 or b == 10 # True

# #False     false
# a == 1 or b == 1 # False


# #a == 1 or b == 4 and a == 5 or b == 2 

# #  если хотябы одна часть выражения возвращает True - будет True

# not True # False
# not False # True 

#      # True
# not a == 5   #False 
# #    True          True
# not a < 10 or not b == 6 # False

#  #  true        true    true      true      true         false       false
# not b > 20 and a == 5 or b == 6 or a < 6 and b >= 6 or not a == 5 and 5 == 10 # True 


# '============================ Boolean type ======================================'

# # булевый тип данных имеет всего 2 значения True и False



# bool(1) # True 
# bool(-12) # True 
# bool(0) # False 

# bool('hello') #True 
# bool(' ') # True
# # print(bool()) # False
# bool('_') # True 
# bool('') #False
# bool(True) # True 
# bool(False) # False 


# admin_status = True 
 

# '=========================================  NoneType (Пустота)  ================================================'

# # None - неизменяемый тип данных с одним значением None, который используется для обозначения отсутствие значения 

# a = None 
# bool(None) # False

a = 5 
b = 5 
a == b # True 
a is b # True 
print(id(a), id(b)) 

'==============================================  Условные операторы (if, else)  ======================================================='

# Условные операторы - это некоя конструкция, которая используется для того, чтобы при разных данных код работал по разному (в зависимости от условия)

# if  условие1 : 
#     действие1 
# weather = input('введите погоду: ')

# if weather == 'солнечно':
#     print('взять солнц-очки')
# elif weather == 'дождливо':
#     print('Взять зонтик')
# else:
#     print('sdjkdjjxbv')

# # elif
# # else 

'=====================================  Тернарный оператор  ===================================='

# тернарный оператор - это условие в одну строку                                          '=== монкинг тайп быстро печатание ' 

# простой 
num = 23
if num > 0:  # условие1 
    chislo = 'положительное' # действие1 
else:
    chislo = 'отрицательное' # действие2

# тернарный 

# chislo = действие1 if условие1 else действие2

chislo = 'положительное' if num > 0 else 'отрицательное'
